[
  {
    "id": 1,
    "title": "Visual Recognition and Social Interaction Application for the Visually Impaired",
    "shortDescription": "An AI-powered mobile application that helps visually impaired individuals recognize their surroundings and enhance social interaction.",
    "fullDescription": "Independent navigation and social participation are significant challenges for visually impaired individuals. To address this, I developed a mobile application that uses Azure Computer Vision and GPT-3.5 technologies to analyze surrounding objects and environments. It provides audio descriptions to the user, effectively allowing them to 'see' their surroundings. Additionally, it encourages social interaction by suggesting nearby social venues and museums based on the user's location.",
    "imageUrl": "img/gorme_pp.jpg",
    "technologies": [ "C#", "XML", ".NET Framework 4.7", "Xamarin.Forms", "Azure Computer Vision", "OpenAI GPT-3.5", "Google Places API", "Visual Studio" ],
    "createdDate": "2023-12-21",
    "projectUrl": "#",
    "Category": "Mobile Application",
    "githubUrl": "https://github.com/kadirbeskardes/GormeEngelliUygulama",
    "features": [
      "Environment and object recognition via camera",
      "AI-powered detailed voice descriptions",
      "Location-based social venue and museum recommendations",
      "Automatic error reporting and feedback system"
    ],
    "screenshots": [],
    "challenges": "Providing accurate visual recognition and clear voice descriptions for visually impaired users in real-time.",
    "solutions": "High accuracy (95%) in voice descriptions was achieved by integrating Azure Computer Vision for object detection and GPT-3.5 for natural language processing.",
    "impact": "Users' independent mobility was improved, and their interaction with the environment was strengthened."
  },
  {
    "id": 2,
    "title": "Remind Me - Medication Tracking and Reminder System",
    "shortDescription": "A mobile healthcare application that enables interaction between doctors and patients with medication reminders.",
    "fullDescription": "Medication adherence is critical yet difficult to track for Alzheimer's patients. Remind Me digitizes this process to ensure patients take their medication on time. Doctors can remotely manage patients' medication schedules, while patients can confirm intake via video recording. This ensures the treatment process is followed continuously and reliably.",
    "imageUrl": "img/remind_pp.jpg",
    "technologies": [ "C#", "XAML", "Xamarin.Forms", ".NET", "Firebase Realtime Database", "Firebase Storage", "Android Studio", "Visual Studio" ],
    "createdDate": "2022-12-01",
    "projectUrl": "#",
    "githubUrl": "https://github.com/kadirbeskardes/RemindMe",
    "Category": "Mobile Application",
    "features": [
      "Smart medication reminders",
      "Secure medication intake confirmation via video",
      "Instant data sharing between doctor and patient",
      "User-friendly patient and doctor dashboards"
    ],
    "screenshots": [],
    "challenges": "Ensuring instant and reliable data flow between patient and doctor, and verifying medication intake accurately.",
    "solutions": "Millisecond-level data synchronization was achieved with Firebase Realtime Database. Treatment security was enhanced with the video verification system."
  },
  {
    "id": 3,
    "title": "Kitabika: Book Management and E-Commerce Platform",
    "shortDescription": "A modern book sales platform developed with layered architecture, featuring comprehensive user and admin panels.",
    "fullDescription": "Traditional book sales methods often fall short in inventory tracking and customer management. Kitabika is an end-to-end e-commerce solution developed with ASP.NET Core 9.0 and Layered Architecture to enable the digital transformation of businesses. It automates book sales processes and increases sales performance with its secure payment infrastructure, detailed admin panel, and user-friendly interface.",
    "imageUrl": "img/kitabika_pp.jpg",
    "technologies": [
      "C#",
      "ASP.NET Core 9.0",
      "Entity Framework Core",
      "AutoMapper",
      "BCrypt.Net",
      "SQL Server",
      "jQuery",
      "Visual Studio 2022"
    ],
    "createdDate": "2025-06-07",
    "projectUrl": "#",
    "Category": "Web Application",
    "githubUrl": "https://github.com/kadirbeskardes/Kitabika",
    "features": [
      "Role-based secure user and admin login",
      "Dynamic inventory and category management",
      "Cart and order tracking system",
      "Advanced admin panel and sales reports",
      "Sustainable layered architecture and SOLID principles"
    ],
    "screenshots": [],
    "challenges": "Designing complex e-commerce processes in a manageable, secure, and scalable structure.",
    "solutions": "Code repetition was prevented and database integrity was ensured using Repository and Unit of Work patterns. Data transfer was optimized with AutoMapper."
  },
  {
    "id": 4,
    "title": "Text and Image Hiding & Encryption on Images",
    "shortDescription": "A data hiding application developed using LSB steganography and encryption algorithms.",
    "fullDescription": "Data security and privacy are among today's most important issues. This project ensures the secure transmission of sensitive data by hiding it within image files. Developed using Python and the LSB (Least Significant Bit) algorithm, the application not only hides data but also adds an extra layer of security with Blowfish and Caesar encryption algorithms.",
    "imageUrl": "img/stego_pp.jpg",
    "technologies": [ "Python", "Tkinter", "Numpy", "Pillow", "LSB", "Blowfish", "Caesar Cipher", "PSNR", "SSIM" ],
    "createdDate": "2024-05-20",
    "projectUrl": "#",
    "githubUrl": "https://github.com/kadirbeskardes/Steganografi_Py",
    "Category": "Desktop Application",
    "features": [
      "Hiding text and images within images",
      "Double-layer encryption with Blowfish and Caesar algorithms",
      "Image quality control with PSNR and SSIM analysis",
      "Easy-to-use desktop interface"
    ],
    "screenshots": [
      "images/project1-1.jpg",
      "images/project1-2.jpg"
    ],
    "challenges": "Ensuring data is hidden without degrading the carrier image quality and remaining undetectable.",
    "solutions": "The LSB algorithm was optimized to hide data with changes imperceptible to the human eye. Quality loss was minimized through PSNR analysis."
  },
  {
    "id": 5,
    "title": "GrinGrid - Real-Time Chat Application",
    "shortDescription": "A secure, cross-platform instant messaging application developed with Xamarin and Firebase.",
    "fullDescription": "Speed and security are essential in individual and corporate communication. GrinGrid is a real-time messaging solution based on Firebase that works seamlessly on iOS and Android platforms with its Xamarin.Forms infrastructure. Users can share media and files securely in addition to instant messaging.",
    "imageUrl": "img/chat_pp.jpg",
    "technologies": [ "Xamarin.Forms", "C#", "Firebase", "XAML", "Xamarin.Essentials", "Plugin.Media", "Firebase Realtime Database", "Firebase Storage" ],
    "createdDate": "2023-01-11",
    "projectUrl": "#",
    "githubUrl": "https://github.com/kadirbeskardes/HaasChat",
    "Category": "Mobile Application",
    "features": [
      "Real-time messaging",
      "Photo and file sharing",
      "Cross-platform (iOS & Android) compatibility",
      "Secure user authentication"
    ],
    "screenshots": [
      "images/gringrid-login.jpg",
      "images/gringrid-chat.jpg"
    ],
    "challenges": "Providing a consistent user experience across different mobile platforms and managing instant data flow.",
    "solutions": "A shared UI code base was created with Xamarin.Forms, and messages were delivered in milliseconds using Firebase Realtime Database."
  },
  {
    "id": 6,
    "title": "Spell Checker (Text Mining Application)",
    "shortDescription": "A desktop application developed with Python and Tkinter that performs spelling correction.",
    "fullDescription": "Spelling errors in text inputs negatively affect communication and data quality. This Python application detects errors in texts using natural language processing techniques and suggests the most appropriate corrections. Thanks to frequency analyses performed on large datasets, it predicts the user's intended word with high accuracy.",
    "imageUrl": "img/spell_pp.jpg",
    "technologies": [
      "Python",
      "Tkinter",
      "Regex",
      "Counter",
      "Natural Language Processing",
      "Edit Distance"
    ],
    "createdDate": "2024-05-15",
    "projectUrl": "#",
    "githubUrl": "https://github.com/kadirbeskardes/Spell-Checking",
    "Category": "Desktop Application",
    "features": [
      "Automatic spelling error detection",
      "Smart suggestion system based on word frequency",
      "Minimum Edit Distance algorithm",
      "Fast and interactive user interface"
    ],
    "screenshots": [
      "images/spellchecker-1.jpg",
      "images/spellchecker-2.jpg"
    ],
    "challenges": "Suggesting the most correct suggestion for a misspelled word quickly.",
    "solutions": "Probability calculations were made on a large word pool, and the nearest correct word was suggested using Levenshtein distance."
  },
  {
    "id": 7,
    "title": "Testival - Tournament and Quiz Application",
    "shortDescription": "A cross-platform application where users can create interactive tournaments and quizzes based on pairwise comparisons.",
    "fullDescription": "Classic survey and test methods can sometimes limit user interaction. Testival makes test-taking fun and competitive with pairwise comparison tournaments working on a 'This or That?' logic. With the React Native mobile app and ASP.NET Core web panel, users can create and share their own tournaments from any platform.",
    "imageUrl": "img/testival_pp.jpg",
    "technologies": [
      "C#",
      "ASP.NET Core 8",
      "Entity Framework Core",
      "SQL Server/Azure SQL",
      "React Native",
      "Expo",
      "TypeScript",
      "JWT Authentication",
      "Azure App Service",
      "PWA",
      "Bootstrap",
      "Axios",
      "Visual Studio"
    ],
    "createdDate": "2025-09-28",
    "projectUrl": "https://tourmentapp-bpbfcufgc4feejbf.polandcentral-01.azurewebsites.net",
    "Category": "Full-Stack Application",
    "githubUrl": "https://github.com/kadirbeskardes/TourmentApp",
    "features": [
      "Full Web and Mobile (iOS/Android) integration",
      "Tournament bracket algorithm",
      "Secure session management with JWT",
      "Azure cloud-based scalable infrastructure",
      "Access on any device with PWA support"
    ],
    "screenshots": [],
    "challenges": "Running complex tournament algorithms (bracket system) synchronously on both web and mobile.",
    "solutions": "A strong algorithm service was established on the backend, and interfaces fully compatible with this service were developed on the React Native and React web sides."
  },
  {
  "id": 8,
  "title": "WeatherThen",
  "shortDescription": "Sophisticated, visual-first weather application with premium lifestyle insights and customizable widgets.",
  "fullDescription": "WeatherThen is a comprehensive weather application designed to provide more than just the temperature. It combines accurate real-time data from Open-Meteo with immersive visualizations that reflect the current weather and time of day. Beyond standard forecasts, it offers deep insights into air quality, solar/lunar cycles, and comfort indices. The app features a robust premium tier that unlocks advanced charts, clothing suggestions, unlimited location favorites, and a suite of highly customizable Android home screen widgets, ensuring users are always prepared for the elements.",
  "imageUrl": "assets/icon.png",
  "technologies": [
    "React Native",
    "Expo",
    "TypeScript",
    "Open-Meteo API",
    "React Navigation",
    "Reanimated",
    "AsyncStorage",
    "Android Widgets"
  ],
  "createdDate": "2025-08-15",
  "projectUrl": "#",
  "Category": "Mobil Uygulama",
  "githubUrl": "https://github.com/your-username/WeatherThen",
  "features": [
    "Real-time weather tracking with dynamic background animations",
    "Advanced metrics: Air Quality, UV Index, and Moon Phases",
    "Premium lifestyle tools: Comfort Index and Clothing Suggestions",
    "Interactive 48-hour and 7-day forecast charts",
    "Customizable Android Home Screen Widgets",
    "Freemium model with subscription management"
  ],
  "screenshots": [],
  "challenges": "Developing a performant widget system that stays synchronized with the main app's data while managing battery efficiency and background update limitations on Android.",
  "solutions": "Implemented a shared caching layer using AsyncStorage to serve both the app and widgets, utilizing 'react-native-android-widget' for native rendering capabilities without native code complexity.",
  "impact": "Empowers users to make better daily decisions through actionable weather insights and convenient home screen access, bridging the gap between raw data and daily life utility."
}
]