[
  {
    "id": 1,
    "title": "Görme Engelliler İçin Görsel Tanıma ve Sosyal Etkileşim Uygulaması",
    "shortDescription": "Görme engelli bireylerin çevrelerini tanımalarına ve sosyal etkileşimlerini artırmalarına yardımcı olan yapay zekâ destekli mobil uygulama.",
    "fullDescription": "Görme engelli bireylerin çevrelerini bağımsız bir şekilde tanımaları ve sosyal hayata katılımları büyük bir zorluktur. Bu sorunu çözmek için geliştirdiğim bu mobil uygulama, Azure Computer Vision ve GPT-3.5 teknolojilerini kullanarak çevredeki nesneleri ve mekanları analiz eder. Kullanıcıya sesli betimlemeler sunarak çevresini 'görmesini' sağlar. Ayrıca, kullanıcının konumuna göre yakındaki sosyal alanları ve müzeleri önererek sosyal etkileşimi teşvik eder.",
    "imageUrl": "img/gorme_pp.jpg",
    "technologies": [ "C#", "XML", ".NET Framework 4.7", "Xamarin.Forms", "Azure Computer Vision", "OpenAI GPT-3.5", "Google Places API", "Visual Studio" ],
    "createdDate": "2023-12-21",
    "projectUrl": "#",
    "Category": "Mobil Uygulama",
    "githubUrl": "https://github.com/kadirbeskardes/GormeEngelliUygulama",
    "features": [
      "Kamera ile ortam ve nesne tanıma",
      "Yapay zeka destekli detaylı sesli betimleme",
      "Lokasyon tabanlı sosyal mekan ve müze önerileri",
      "Otomatik hata raporlama ve geri bildirim sistemi"
    ],
    "screenshots": [],
    "challenges": "Görme engelli kullanıcılar için görsel dünyayı anlaşılır ve hızlı bir şekilde sesli veriye dönüştürmek.",
    "solutions": "Azure Computer Vision ile nesne algılama ve GPT-3.5 ile doğal dil işleme entegrasyonu sağlanarak %95 doğrulukla sesli betimleme yapıldı.",
    "impact": "Kullanıcıların bağımsız hareket kabiliyeti artırıldı ve çevreyle etkileşimleri güçlendirildi."
  },
  {
    "id": 2,
    "title": "Remind Me - İlaç Takip ve Hatırlatma Sistemi",
    "shortDescription": "Doktor ve hasta arasında etkileşim sağlayan, ilaç hatırlatmaları yapan mobil sağlık uygulaması.",
    "fullDescription": "Alzheimer hastaları ve düzenli ilaç kullanması gereken bireyler için ilaç takibi hayati önem taşır, ancak takibi zordur. Remind Me, bu süreci dijitalleştirerek hastaların ilaçlarını zamanında almasını garanti altına alır. Doktorlar hastalarının ilaç programlarını uzaktan yönetebilirken, hastalar ilaçlarını aldıklarını video kaydı ile doğrulayabilirler. Bu sayede tedavi süreci kesintisiz ve güvenilir bir şekilde takip edilir.",
    "imageUrl": "img/remind_pp.jpg",
    "technologies": [ "C#", "XAML", "Xamarin.Forms", ".NET", "Firebase Realtime Database", "Firebase Storage", "Android Studio", "Visual Studio" ],
    "createdDate": "2022-12-01",
    "projectUrl": "#",
    "githubUrl": "https://github.com/kadirbeskardes/RemindMe",
    "Category": "Mobil Uygulama",
    "features": [
      "Zaman ayarlı akıllı ilaç bildirimleri",
      "Video kaydı ile güvenli ilaç alım onayı",
      "Doktor-Hasta arası anlık veri paylaşımı",
      "Kullanıcı dostu hasta ve doktor panelleri"
    ],
    "screenshots": [],
    "challenges": "Hasta ve doktor arasındaki veri akışının anlık ve güvenilir olması, ilaç kullanımının kesin olarak doğrulanması.",
    "solutions": "Firebase Realtime Database ile milisayine bazında veri senkronizasyonu sağlandı. Video doğrulama sistemi ile tedavi güvenliği artırıldı."
  },
  {
    "id": 3,
    "title": "Kitabika: Kitap Yönetim ve E-Ticaret Platformu",
    "shortDescription": "Kapsamlı kullanıcı ve yönetici paneline sahip, katmanlı mimariyle geliştirilmiş modern bir kitap satış platformu.",
    "fullDescription": "Geleneksel kitap satış yöntemleri stok takibi ve müşteri yönetiminde yetersiz kalmaktadır. Kitabika, işletmelerin dijital dönüşümünü sağlamak için ASP.NET Core 9.0 ve Katmanlı Mimari ile geliştirilmiş uçtan uca bir e-ticaret çözümüdür. Güvenli ödeme altyapısı, detaylı admin paneli ve kullanıcı dostu arayüzü ile kitap satış süreçlerini otomatize eder ve satış performansını artırır.",
    "imageUrl": "img/kitabika_pp.jpg",
    "technologies": [
      "C#",
      "ASP.NET Core 9.0",
      "Entity Framework Core",
      "AutoMapper",
      "BCrypt.Net",
      "SQL Server",
      "jQuery",
      "Visual Studio 2022"
    ],
    "createdDate": "2025-06-07",
    "projectUrl": "#",
    "Category": "Web Uygulaması",
    "githubUrl": "https://github.com/kadirbeskardes/Kitabika",
    "features": [
      "Rol tabanlı güvenli kullanıcı ve yönetici girişi",
      "Dinamik stok ve kategori yönetimi",
      "Sepet ve sipariş takip sistemi",
      "Gelişmiş admin paneli ve satış raporları",
      "Sürdürülebilir katmanlı mimari ve SOLID prensipleri"
    ],
    "screenshots": [],
    "challenges": "Karmaşık e-ticaret süreçlerinin yönetilebilir, güvenli ve ölçeklenebilir bir yapıda kurgulanması.",
    "solutions": "Repository ve Unit of Work desenleri ile kod tekrarı önlendi, veritabanı bütünlüğü sağlandı. AutoMapper ile veri transferi optimize edildi."
  },
  {
    "id": 4,
    "title": "Görüntü Üzerinde Metin ve Görsel Gizleme & Şifreleme",
    "shortDescription": "LSB steganografi ve şifreleme algoritmalarıyla geliştirilen veri gizleme uygulaması.",
    "fullDescription": "Veri güvenliği ve gizliliği günümüzün en önemli sorunlarından biridir. Bu proje, hassas verilerin görsel dosyalar içine gizlenerek güvenli bir şekilde iletilmesini sağlar. Python ve LSB (Least Significant Bit) algoritması kullanılarak geliştirilen uygulama, verileri sadece gizlemekle kalmaz, Blowfish ve Sezar şifreleme algoritmalarıyla ekstra bir güvenlik katmanı ekler.",
    "imageUrl": "img/stego_pp.jpg",
    "technologies": [ "Python", "Tkinter", "Numpy", "Pillow", "LSB", "Blowfish", "Sezar Cipher", "PSNR", "SSIM" ],
    "createdDate": "2024-05-20",
    "projectUrl": "#",
    "githubUrl": "https://github.com/kadirbeskardes/Steganografi_Py",
    "Category": "Masaüstü Uygulama",
    "features": [
      "Görsel içinde metin ve resim gizleme",
      "Blowfish ve Sezar algoritmalarıyla çift katmanlı şifreleme",
      "PSNR ve SSIM analizleri ile görüntü kalite kontrolü",
      "Kolay kullanımlı masaüstü arayüzü"
    ],
    "screenshots": [
      "images/project1-1.jpg",
      "images/project1-2.jpg"
    ],
    "challenges": "Veriyi gizlerken taşıyıcı görselin kalitesinin bozulmaması ve fark edilmemesi.",
    "solutions": "LSB algoritması optimize edilerek insan gözünün algılayamayacağı değişikliklerle veri gizlendi. PSNR analizleriyle kalite kaybı minimize edildi."
  },
  {
    "id": 5,
    "title": "GrinGrid - Gerçek Zamanlı Chat Uygulaması",
    "shortDescription": "Xamarin ve Firebase ile geliştirilen, çok platformlu ve güvenli bir anlık mesajlaşma uygulaması.",
    "fullDescription": "Bireysel ve kurumsal iletişimde hız ve güvenlik esastır. GrinGrid, Xamarin.Forms altyapısı ile iOS ve Android platformlarında sorunsuz çalışan, Firebase tabanlı gerçek zamanlı bir mesajlaşma çözümüdür. Kullanıcılar anlık mesajlaşmanın yanı sıra güvenli bir şekilde medya ve dosya paylaşımı yapabilirler.",
    "imageUrl": "img/chat_pp.jpg",
    "technologies": [ "Xamarin.Forms", "C#", "Firebase", "XAML", "Xamarin.Essentials", "Plugin.Media", "Firebase Realtime Database", "Firebase Storage" ],
    "createdDate": "2023-01-11",
    "projectUrl": "#",
    "githubUrl": "https://github.com/kadirbeskardes/HaasChat",
    "Category": "Mobil Uygulama",
    "features": [
      "Gerçek zamanlı (Real-time) mesajlaşma",
      "Fotoğraf ve dosya paylaşımı",
      "Çapraz platform (iOS & Android) uyumluluğu",
      "Güvenli kullanıcı kimlik doğrulama"
    ],
    "screenshots": [
      "images/gringrid-login.jpg",
      "images/gringrid-chat.jpg"
    ],
    "challenges": "Farklı mobil platformlarda tutarlı bir kullanıcı deneyimi sunmak ve anlık veri akışını yönetmek.",
    "solutions": "Xamarin.Forms ile ortak UI kod tabanı oluşturuldu, Firebase Realtime Database ile mesajların milisaniyeler içinde iletilmesi sağlandı."
  },
  {
    "id": 6,
    "title": "Yazım Denetleyici (Metin Madenciliği Uygulaması)",
    "shortDescription": "Python ve Tkinter ile geliştirilen, kelime düzeltme ve yazım denetimi yapan masaüstü uygulama.",
    "fullDescription": "Metin girişlerinde yapılan yazım hataları iletişimi ve veri kalitesini olumsuz etkiler. Bu Python uygulaması, doğal dil işleme tekniklerini kullanarak metinlerdeki hataları tespit eder ve en uygun düzeltmeleri önerir. Büyük veri kümeleri üzerinde yapılan frekans analizleri sayesinde, kullanıcının kastettiği kelimeyi yüksek doğrulukla tahmin eder.",
    "imageUrl": "img/spell_pp.jpg",
    "technologies": [
      "Python",
      "Tkinter",
      "Regex",
      "Counter",
      "Natural Language Processing",
      "Edit Distance"
    ],
    "createdDate": "2024-05-15",
    "projectUrl": "#",
    "githubUrl": "https://github.com/kadirbeskardes/Spell-Checking",
    "Category": "Masaüstü Uygulama",
    "features": [
      "Otomatik yazım hatası tespiti",
      "Kelime frekansına dayalı akıllı öneri sistemi",
      "Minimum Düzenleme Mesafesi (Edit Distance) algoritması",
      "Hızlı ve interaktif kullanıcı arayüzü"
    ],
    "screenshots": [
      "images/spellchecker-1.jpg",
      "images/spellchecker-2.jpg"
    ],
    "challenges": "Hatalı kelime için en doğru öneriyi hızlı bir şekilde sunmak.",
    "solutions": "Geniş bir kelime havuzu üzerinde olasılık hesaplamaları yapılarak ve Levenshtein mesafesi kullanılarak en yakın doğru kelime önerildi."
  },
  {
    "id": 7,
    "title": "Testival - Tournament ve Quiz Uygulaması",
    "shortDescription": "Kullanıcıların etkileşimli turnuvalar ve quizler oluşturabileceği, karşılaştırma tabanlı yarışmalar düzenleyebileceği çok platformlu uygulama.",
    "fullDescription": "Klasik anket ve test yöntemleri bazen kullanıcı etkileşimini sınırlayabilir. Testival, 'Bu mu, Şu mu?' mantığıyla çalışan ikili karşılaştırma turnuvaları ile test çözmeyi eğlenceli ve rekabetçi hale getirir. React Native mobil uygulaması ve ASP.NET Core web paneli ile kullanıcılar diledikleri platformdan kendi turnuvalarını oluşturup paylaşabilirler.",
    "imageUrl": "img/testival_pp.jpg",
    "technologies": [
      "C#",
      "ASP.NET Core 8",
      "Entity Framework Core",
      "SQL Server/Azure SQL",
      "React Native",
      "Expo",
      "TypeScript",
      "JWT Authentication",
      "Azure App Service",
      "PWA",
      "Bootstrap",
      "Axios",
      "Visual Studio"
    ],
    "createdDate": "2025-09-28",
    "projectUrl": "https://tourmentapp-bpbfcufgc4feejbf.polandcentral-01.azurewebsites.net",
    "Category": "Full-Stack Uygulama",
    "githubUrl": "https://github.com/kadirbeskardes/TourmentApp",
    "features": [
      "Web ve Mobil (iOS/Android) tam entegrasyon",
      "Turnuva ağacı (Bracket) algoritması",
      "JWT ile güvenli oturum yönetimi",
      "Azure bulut tabanlı ölçeklenebilir altyapı",
      "PWA desteği ile her cihazda erişim"
    ],
    "screenshots": [],
    "challenges": "Karmaşık turnuva algoritmalarını (bracket system) hem web hem mobilde senkronize çalıştırmak.",
    "solutions": "Backend tarafında güçlü bir algoritma servisi kuruldu, React Native ve React web tarafında bu servis ile tam uyumlu arayüzler geliştirildi."
  },
  {
  "id": 8,
  "title": "WeatherThen",
  "shortDescription": "Premium yaşam tarzı öngörüleri ve özelleştirilebilir widget'lar sunan, görsellik odaklı, gelişmiş bir hava durumu uygulaması.",
  "fullDescription": "WeatherThen, sadece sıcaklığı göstermekten fazlasını sunmak için tasarlanmış kapsamlı bir hava durumu uygulamasıdır. Open-Meteo'dan alınan doğru ve gerçek zamanlı verileri, mevcut hava durumunu ve günün saatini yansıtan sürükleyici görselleştirmelerle birleştirir. Standart tahminlerin ötesinde; hava kalitesi, güneş/ay döngüleri ve konfor endeksleri hakkında derinlemesine bilgiler sunar. Uygulama; gelişmiş grafikleri, kıyafet önerilerini, sınırsız favori konum eklemeyi ve kullanıcıların her türlü hava koşuluna hazırlıklı olmasını sağlayan son derece özelleştirilebilir Android ana ekran widget'larını içeren güçlü bir premium seviyeye sahiptir.",
  "imageUrl": "assets/icon.png",
  "technologies": [
    "React Native",
    "Expo",
    "TypeScript",
    "Open-Meteo API",
    "React Navigation",
    "Reanimated",
    "AsyncStorage",
    "Android Widgets"
  ],
  "createdDate": "2025-08-15",
  "projectUrl": "#",
  "Category": "Mobil Uygulama",
  "githubUrl": "https://github.com/your-username/WeatherThen",
  "features": [
    "Dinamik arka plan animasyonları ile gerçek zamanlı hava durumu takibi",
    "Gelişmiş metrikler: Hava Kalitesi, UV İndeksi ve Ay Evreleri",
    "Premium yaşam tarzı araçları: Konfor İndeksi ve Kıyafet Önerileri",
    "Etkileşimli 48 saatlik ve 7 günlük tahmin grafikleri",
    "Özelleştirilebilir Android Ana Ekran Widget'ları",
    "Abonelik yönetimi içeren Freemium model"
  ],
  "screenshots": [],
  "challenges": "Android'deki pil verimliliğini ve arka plan güncelleme sınırlamalarını yönetirken, aynı zamanda ana uygulamanın verileriyle senkronize kalan performanslı bir widget sistemi geliştirmek.",
  "solutions": "Hem uygulamaya hem de widget'lara hizmet etmek için AsyncStorage kullanarak paylaşılan bir önbellekleme katmanı uygulandı ve yerel kod (native code) karmaşıklığı olmadan yerel işleme yetenekleri için 'react-native-android-widget' kütüphanesi kullanıldı.",
  "impact": "Ham veriler ile günlük yaşam faydası arasındaki köprüyü kurarak, eyleme geçirilebilir hava durumu içgörüleri ve kolay ana ekran erişimi sayesinde kullanıcıların daha iyi günlük kararlar almasını sağlar."
}
]